<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v1.1.2 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of Maxon Cinema 4D and creates a package.</string>
	<key>Identifier</key>
	<string>com.github.kkeilson.pkg.pkg.MaxonCinema4D</string>
	<key>Input</key>
	<dict>
		<key>APP_FILENAME</key>
		<string>Maxon Cinema 4D R21 Full Installer</string>
		<key>BUNDLE_ID</key>
		<string>net.maxon.cinema4d.installer</string>
		<key>NAME</key>
		<string>Maxon Cinema 4D</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.kkeilson.pkg.download.MaxonCinema4D</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>AppPkgCreator</string>
		</dict>
	</array>
</dict>
</plist>
